'''
    [ 음악 연주 ]

    캐롤 구성
    클래식 구성

    다음 과정을 무한 반복
        만약, A버튼을 누르면,
            캐롤 연주
        그렇지 않고 B버튼을 누르면,
            클래식 연주
    -----------------------------------------------------------

    import music
        •음악 연주와 관련 있는 모든 명령을 사용하기 위한 모듈을 호출함.

    music.play(음악명)
        •( )안 ‘음악명’에 저장된 음악을 연주함.

    C4:4
        피아노에서 가장 기본 옥타브(열쇠 구멍 위의 오른손 기본 위치)인 4옥타브의
        도(C)를 4박자로 연주하라는 의미입니다.
'''

from microbit import *          # 마이크로비트 모듈의 모든 명령 사용
# 음악 모듈 사용

carol = [  # 고요한 밤, 거룩한 밤
    'g4:3', 'a:1', 'g:2', 'e:6', 'g:3', 'a:1', 'g:2', 'e:6', 'd5:4', 'd5:2',
    'b4:6', 'c5:4', 'c5:2', 'g4:6', 'a:4', 'a:2', 'c5:3', 'b4:1', 'a:2',
    'g:3', 'a:1', 'g:2', 'e:6', 'a:4', 'a:2', 'c5:3', 'b4:1', 'a:2', 'g:3',
    'a:1', 'g:2', 'e:6', 'd5:4', 'd5:2', 'f5:3', 'd5:2', 'b4:2', 'c5:6',
    'e5:6', 'c5:2', 'g4:2', 'e:2', 'g:3', 'f:1', 'd:2', 'c:6'
]

classic = [  # 바흐 전주곡(출처: UCL’s BBC Micro:bit Tutorials)
    'c4:1', 'e', 'g', 'c5', 'e5', 'g4', 'c5', 'e5', 'c4', 'e', 'g', 'c5', 'e5',
    'g4', 'c5', 'e5', 'c4', 'd', 'a', 'd5', 'f5', 'a4', 'd5', 'f5', 'c4', 'd',
    'a', 'd5', 'f5', 'a4', 'd5', 'f5', 'b3', 'd4', 'g', 'd5', 'f5', 'g4', 'd5',
    'f5', 'b3', 'd4', 'g', 'd5', 'f5', 'g4', 'd5', 'f5', 'c4', 'e', 'g', 'c5',
    'e5', 'g4', 'c5', 'e5', 'c4', 'e', 'g', 'c5', 'e5', 'g4', 'c5', 'e5', 'c4',
    'e', 'a', 'e5', 'a5', 'a4', 'e5', 'a5', 'c4', 'e', 'a', 'e5', 'a5', 'a4',
    'e5', 'a5', 'c4', 'd', 'f#', 'a', 'd5', 'f#4', 'a', 'd5', 'c4', 'd', 'f#',
    'a', 'd5', 'f#4', 'a', 'd5', 'b3', 'd4', 'g', 'd5', 'g5', 'g4', 'd5', 'g5',
    'b3', 'd4', 'g', 'd5', 'g5', 'g4', 'd5', 'g5', 'b3', 'c4', 'e', 'g', 'c5',
    'e4', 'g', 'c5', 'b3', 'c4', 'e', 'g', 'c5', 'e4', 'g', 'c5', 'a3', 'c4',
    'e', 'g', 'c5', 'e4', 'g', 'c5', 'a3', 'c4', 'e', 'g', 'c5', 'e4', 'g',
    'c5', 'd3', 'a', 'd4', 'f#', 'c5', 'd4', 'f#', 'c5', 'd3', 'a', 'd4', 'f#',
    'c5', 'd4', 'f#', 'c5', 'g3', 'b', 'd4', 'g', 'b', 'd', 'g', 'b', 'g3',
    'b3', 'd4', 'g', 'b', 'd', 'g', 'b'
]

while True:
# 만약, A버튼을 누르면
# carol 연주
# 그렇지 않고 B버튼을 누르면
# classic 연주
