from microbit import *
import music

carol = [  # 고요한 밤, 거룩한 밤
    'g4:3', 'a:1', 'g:2', 'e:6', 'g:3', 'a:1', 'g:2', 'e:6', 'd5:4', 'd5:2',
    'b4:6', 'c5:4', 'c5:2', 'g4:6', 'a:4', 'a:2', 'c5:3', 'b4:1', 'a:2', 'g:3',
    'a:1', 'g:2', 'e:6', 'a:4', 'a:2', 'c5:3', 'b4:1', 'a:2', 'g:3', 'a:1',
    'g:2', 'e:6', 'd5:4', 'd5:2', 'f5:3', 'd5:2', 'b4:2', 'c5:6', 'e5:6',
    'c5:2', 'g4:2', 'e:2', 'g:3', 'f:1', 'd:2', 'c:6'
]

classic = [  # 바흐 전주곡(출처: UCL’s BBC Micro:bit Tutorials)
    'c4:1', 'e', 'g', 'c5', 'e5', 'g4', 'c5', 'e5', 'c4', 'e', 'g', 'c5', 'e5',
    'g4', 'c5', 'e5', 'c4', 'd', 'a', 'd5', 'f5', 'a4', 'd5', 'f5', 'c4', 'd',
    'a', 'd5', 'f5', 'a4', 'd5', 'f5', 'b3', 'd4', 'g', 'd5', 'f5', 'g4', 'd5',
    'f5', 'b3', 'd4', 'g', 'd5', 'f5', 'g4', 'd5', 'f5', 'c4', 'e', 'g', 'c5',
    'e5', 'g4', 'c5', 'e5', 'c4', 'e', 'g', 'c5', 'e5', 'g4', 'c5', 'e5', 'c4',
    'e', 'a', 'e5', 'a5', 'a4', 'e5', 'a5', 'c4', 'e', 'a', 'e5', 'a5', 'a4',
    'e5', 'a5', 'c4', 'd', 'f#', 'a', 'd5', 'f#4', 'a', 'd5', 'c4', 'd', 'f#',
    'a', 'd5', 'f#4', 'a', 'd5', 'b3', 'd4', 'g', 'd5', 'g5', 'g4', 'd5', 'g5',
    'b3', 'd4', 'g', 'd5', 'g5', 'g4', 'd5', 'g5', 'b3', 'c4', 'e', 'g', 'c5',
    'e4', 'g', 'c5', 'b3', 'c4', 'e', 'g', 'c5', 'e4', 'g', 'c5', 'a3', 'c4',
    'e', 'g', 'c5', 'e4', 'g', 'c5', 'a3', 'c4', 'e', 'g', 'c5', 'e4', 'g',
    'c5', 'd3', 'a', 'd4', 'f#', 'c5', 'd4', 'f#', 'c5', 'd3', 'a', 'd4', 'f#',
    'c5', 'd4', 'f#', 'c5', 'g3', 'b', 'd4', 'g', 'b', 'd', 'g', 'b', 'g3',
    'b3', 'd4', 'g', 'b', 'd', 'g', 'b'
]

bell = [  # 휴대폰벨
    'e5:1', 'd5:1', 'f#4:2', 'g#4:2', 'c#5:1', 'b4:1', 'd4:2', 'e4:2',
    'b4:1', 'a4:1', 'c#4:2', 'e4:2', 'a4:6'
]

while True:
    if button_a.is_pressed():    # 만약, A버튼을 누르면
        music.play(carol)        # carol 연주
    elif button_b.is_pressed():  # 그렇지 않고 B버튼을 누르면
        music.play(classic)      # classic 연주
    elif button_a.is_pressed() and button_b.is_pressed():
        # 그렇지 않고 A버튼과 B버튼을 동시에 누르면
        music.play(bell)        # bell 연주